{
  "entete_web": {
    "titre": "Entête Web",
    "description": "Une requête sur les serveurs web du système d'information est effectuée pour vérifier la présence éventuelle de champs d'en-tête qui devraient être supprimés, car cela est considéré comme un défaut de configuration (X-PoweredBy, X-Frame-Options…).",
    "constat": "Un mauvais en-tête HTTP peut exposer des informations sensibles ou permettre des attaques telles que l'injection de scripts.",
    "remediation": "Pour remédier à ce problème, assurez-vous de configurer correctement l'en-tête HTTP en appliquant les directives de sécurité recommandées.",
    "criticite": "Majeure",
    "scoring": 3
  },
  "cve": {
    "titre": "CVE",
    "description": "A la suite à l'exécution de Nmap, sur le système d'information, il est possible de récupérer les informations relatives aux différentes machines du système en fonction des services qu'elles fournissent. Cela inclut la collecte des versions des services identifiés. En utilisant l'API du NIST (National Institute of Standards and Technology), il est possible d'obtenir des informations sur les vulnérabilités associées à chaque produit et à sa version spécifique. Le NIST maintient une base de données de vulnérabilités connues et fournit des scores CVSS (Common Vulnerability Scoring System) permettant d'évaluer la gravité de chaque vulnérabilité. L’outil permet de récupérer les 3 CVE ayant un score CVSS le plus élevé et ce pour chaque produit et pour chaque hôte.",
    "constat": "L'exploitation des vulnérabilités CVE connues peut permettre à un attaquant de compromettre un système.",
    "remediation": "Il est essentiel de suivre les avis de sécurité, les correctifs et les mises à jour émis par les fournisseurs pour résoudre les vulnérabilités CVE identifiées.",
    "criticite": "Modérée",
    "scoring": 2
  },
  "ssh_bf": {
    "titre": "Connexion à distance",
    "description": "Le test d'attaque par dictionnaire SSH vise à évaluer la robustesse des mots de passe utilisés sur les machines du système d'information qui ont le service SSH ouvert. L'objectif est de réaliser une attaque par dictionnaire en utilisant une liste de mots de passe conçus par nos soins. Ce test consiste à essayer différents mots de passe de la liste générée pour tenter de compromettre les comptes SSH. Il permet de vérifier la résistance des mots de passe utilisés.",
    "constat": "Dans votre infrastructure nous avons detecté des services SSH avec des mots de passes faibles.",
    "remediation": "Pour corriger la vulnérabilité de mot de passe faible sur SSH, vous pouvez mettre en place une politique de complexité de mot de passe, utiliser des outils de gestion de mots de passe, mettre en place la double authentification, limiter l'accès aux comptes utilisateurs et surveiller l'activité du compte utilisateur. En appliquant ces mesures, vous pouvez renforcer la sécurité de votre système SSH et prévenir les attaques par force brute.",
    "criticite": "Mineure",
    "scoring": 5
  },
  "smb_scanner": {
    "titre": "Partage de Fichiers",
    "description": "Le test Accès au fichier partagé vise à trouver des problèmes de sécurité liés aux partages de fichiers SMB. Il vérifie si un accès anonyme non autorisé est possible et examine les fichiers et dossiers accessibles. L'accès anonyme permet à des utilisateurs non authentifiés d'accéder aux fichiers sans identification, ce qui peut être dangereux. La vérification récursive explore la structure des dossiers pour déterminer quels fichiers et dossiers sont accessibles aux utilisateurs anonymes, afin de comprendre l'exposition des données sensibles. Certains partages spécifiques au domaine sont exclus de cette liste.",
    "constat": "Un partage de fichiers mal configuré peut permettre à des utilisateurs non autorisés d'accéder, de modifier ou de supprimer des fichiers sensibles.",
    "remediation": "Il est important de restreindre l'accès aux partages de fichiers en utilisant des autorisations appropriées, des mots de passe forts et en limitant les droits d'accès des utilisateurs.",
    "criticite": "Majeure",
    "scoring": 1
  },
  "dos": {
    "titre": "Attaque DoS",
    "description": "La partie dos concerne les attaques par déni de service (DoS) visant à rendre un service ou une ressource indisponible.",
    "constat": "Les attaques DoS peuvent entraîner une interruption de service, un ralentissement ou une incapacité à accéder à un système ou à un réseau.",
    "remediation": "Pour se prémunir contre les attaques DoS, il est nécessaire de mettre en place des mécanismes de détection et de filtrage du trafic suspect, ainsi que des capacités de mitigation pour réduire l'impact des attaques.",
    "criticite": "Majeure",
    "scoring": 4
  },
  "dhcp_starvation": {
    "titre": "Saturation DHCP",
    "description": "Le test consiste en une attaque appelée 'DHCP Starvation' qui vise à épuiser les ressources du serveur DHCP d'un réseau cible. L'objectif est de priver les clients légitimes d'accéder aux adresses IP fournies par le serveur DHCP. L'attaque consiste à envoyer de nombreuses demandes DHCP avec des adresses MAC aléatoires pour épuiser les ressources du serveur. Ensuite, on vérifie si le serveur DHCP a échoué en envoyant une demande supplémentaire et en vérifiant si une réponse est reçue dans un certain délai. Si aucune réponse n'est reçue, cela indique que le serveur DHCP ne peut pas répondre correctement aux demandes, ce qui suggère que l'attaque a réussi.",
    "constat": "Les attaques de saturation DHCP peuvent épuiser les adresses IP disponibles dans le pool DHCP, empêchant ainsi les nouveaux périphériques de se connecter au réseau.",
    "remediation": "Pour prévenir les attaques de saturation DHCP, il est recommandé de surveiller et de limiter le nombre de demandes DHCP par périphérique, d'appliquer des stratégies de contrôle d'accès et de configurer des mécanismes de détection d'anomalies.",
    "criticite": "Majeure",
    "scoring": 2
  },
  "wifi": {
    "titre": "Faiblesse du mot de passe WiFi",
    "description": "Le test de robustesse des mots de passe des points d'accès Wi-Fi évalue la sécurité des mots de passe utilisés pour les protéger. Il consiste à écouter le réseau pour repérer les points d'accès Wi-Fi disponibles. Ensuite, on force les utilisateurs connectés à se reconnecter afin de capturer l'échange de messages entre leur appareil et le point d'accès, appelé 'handshake'. En analysant ce handshake, on extrait les informations nécessaires pour mener une attaque par dictionnaire sur le mot de passe du point d'accès. Un dictionnaire spécialement conçu est utilisé pour tester la solidité du mot de passe.",
    "remediation": "Pour remédier aux vulnérabilités liées aux mots de passe faibles sur les réseaux Wi-Fi, vous pouvez : utiliser des mots de passe forts, changer régulièrement les mots de passe, utiliser des protocoles de sécurité plus forts, limiter l'accès aux réseaux et surveiller régulièrement la sécurité des réseaux.",
    "criticite": "Majeure",
    "scoring": 3
  },
  "check_tls": {
    "titre": "check tls",
    "description": "Nous effectuons une vérification des algorithmes de chiffrement utilisés par les certificats des serveurs web afin de nous assurer que leur configuration est conforme aux normes en vigueur. Si un algorithme de chiffrement obsolète ou faible est détecté, cela est considéré comme un défaut de configuration. L'utilisation d'algorithmes de chiffrement forts et sécurisés est essentielle pour garantir la confidentialité et l'intégrité des communications entre les clients et les serveurs web. Des algorithmes de chiffrement obsolètes ou vulnérables peuvent exposer les échanges à des risques de compromission de la sécurité.",
    "constat": "Une mauvaise configuration ou des vulnérabilités dans les protocoles TLS peuvent exposer les communications à des attaques telles que le détournement ou l'interception des données.",
    "remediation": "Pour renforcer la sécurité des communications TLS, il est essentiel de suivre les bonnes pratiques de configuration, de mettre à jour régulièrement les versions TLS et d'effectuer des tests de vulnérabilité pour détecter les éventuelles faiblesses dans la configuration du protocole.",
    "criticite": "Majeure",
    "scoring": 1
  },
  "banner": {
    "titre": "RECUPERATION DES BANNIERES",
    "description": "L'utilisation de Nmap nous permet d'explorer et de découvrir les services ouverts sur les machines du système d'information. Grâce à cette analyse, nous sommes en mesure de récupérer les bannières associées à ces services. Si un service a une bannière présente, cela peut être considéré comme un défaut de configuration, car cela peut révéler des informations sensibles sur le service ou sur la version utilisée.",
    "constat": "Une mauvaise configuration ou des vulnérabilités dans les protocoles TLS peuvent exposer les communications à des attaques telles que le détournement ou l'interception des données.",
    "remediation": "Pour renforcer la sécurité des communications TLS, il est essentiel de suivre les bonnes pratiques de configuration, de mettre à jour régulièrement les versions TLS et d'effectuer des tests de vulnérabilité pour détecter les éventuelles faiblesses dans la configuration du protocole.",
    "criticite": "Majeure",
    "scoring": 1
  },
  "netbios": {
    "titre": "SERVICE NETBIOS",
    "description": "Grâce à l'utilisation de Nmap, nous sommes en mesure de détecter la présence de NetBIOS sur les machines du réseau. Dans le cadre de bonnes pratiques de sécurité, la désactivation de NetBIOS est recommandée, et notre outil considérera la présence de NetBIOS comme un défaut de configuration. NetBIOS est un protocole de communication largement utilisé pour le partage de fichiers, l'impression et d'autres services réseau dans les environnements Windows. Cependant, en raison de certaines vulnérabilités et de ses fonctionnalités obsolètes, désactiver NetBIOS est souvent conseillé pour réduire les risques de sécurité associés à son utilisation.",
    "constat": "Une mauvaise configuration ou des vulnérabilités dans les protocoles TLS peuvent exposer les communications à des attaques telles que le détournement ou l'interception des données.",
    "remediation": "Pour renforcer la sécurité des communications TLS, il est essentiel de suivre les bonnes pratiques de configuration, de mettre à jour régulièrement les versions TLS et d'effectuer des tests de vulnérabilité pour détecter les éventuelles faiblesses dans la configuration du protocole.",
    "criticite": "Majeure",
    "scoring": 1
  },
  "spanning-tree": {
    "titre": "ATTAQUE SPANNING TREE",
    "description": "Le protocole STP (Spanning Tree Protocol) gère la structure du réseau pour éviter les problèmes de boucles de communication et optimiser les chemins entre les commutateurs. Cependant, il peut y avoir des configurations ou vulnérabilités qui compromettent la sécurité du réseau. Le test vise à évaluer la sécurité du protocole STP dans le réseau de l'entreprise en détectant les vulnérabilités et en évaluant les défenses contre les attaques. Pour ce faire, on utilise une méthode d'attaque qui consiste à envoyer de faux paquets STP pour manipuler les messages de configuration entre les commutateurs. L'objectif est de modifier la structure du réseau, perturber le calcul des chemins et prendre le contrôle en devenant le commutateur principal.",
    "constat": "Une mauvaise configuration ou des vulnérabilités dans les protocoles TLS peuvent exposer les communications à des attaques telles que le détournement ou l'interception des données.",
    "remediation": "Pour renforcer la sécurité des communications TLS, il est essentiel de suivre les bonnes pratiques de configuration, de mettre à jour régulièrement les versions TLS et d'effectuer des tests de vulnérabilité pour détecter les éventuelles faiblesses dans la configuration du protocole.",
    "criticite": "Majeure",
    "scoring": 3
  },
  "mac-flooding": {
    "titre": "ATTAQUE MAC FLOODING",
    "description": "L'attaque MAC Flooding consiste à saturer les tables d'adresses MAC des commutateurs d'un réseau en envoyant de nombreux paquets avec des adresses MAC aléatoires. Cela provoque une surcharge des tables d'adresses MAC. Lorsque les tables sont pleines, les commutateurs transmettent tous les paquets à tous les périphériques du réseau, ce qui entraîne une diffusion générale des paquets et perturbe les communications normales. L'objectif de cette attaque est de causer un déni de service en épuisant les ressources du réseau ou de faciliter d'autres attaques en profitant de la confusion causée par la diffusion des paquets. Un outil est utilisé pour mesurer l'impact de l'attaque en comparant le nombre de paquets diffusés avant et après son exécution, afin de déterminer si le réseau est vulnérable à cette attaque.",
    "constat": "Une mauvaise configuration ou des vulnérabilités dans les protocoles TLS peuvent exposer les communications à des attaques telles que le détournement ou l'interception des données.",
    "remediation": "Pour renforcer la sécurité des communications TLS, il est essentiel de suivre les bonnes pratiques de configuration, de mettre à jour régulièrement les versions TLS et d'effectuer des tests de vulnérabilité pour détecter les éventuelles faiblesses dans la configuration du protocole.",
    "criticite": "Majeure",
    "scoring": 3
  },
  "web_vuln": {
    "titre": "Web Vuln",
    "description": "L'attaque MAC Flooding consiste à saturer les tables d'adresses MAC des commutateurs d'un réseau en envoyant de nombreux paquets avec des adresses MAC aléatoires. Cela provoque une surcharge des tables d'adresses MAC. Lorsque les tables sont pleines, les commutateurs transmettent tous les paquets à tous les périphériques du réseau, ce qui entraîne une diffusion générale des paquets et perturbe les communications normales. L'objectif de cette attaque est de causer un déni de service en épuisant les ressources du réseau ou de faciliter d'autres attaques en profitant de la confusion causée par la diffusion des paquets. Un outil est utilisé pour mesurer l'impact de l'attaque en comparant le nombre de paquets diffusés avant et après son exécution, afin de déterminer si le réseau est vulnérable à cette attaque.",
    "constat": "Une mauvaise configuration ou des vulnérabilités dans les protocoles TLS peuvent exposer les communications à des attaques telles que le détournement ou l'interception des données.",
    "remediation": "Pour renforcer la sécurité des communications TLS, il est essentiel de suivre les bonnes pratiques de configuration, de mettre à jour régulièrement les versions TLS et d'effectuer des tests de vulnérabilité pour détecter les éventuelles faiblesses dans la configuration du protocole.",
    "criticite": "Majeure",
    "scoring": 2
  },
  "telnet": {
    "titre": "Telnet",
    "description": "L'attaque MAC Flooding consiste à saturer les tables d'adresses MAC des commutateurs d'un réseau en envoyant de nombreux paquets avec des adresses MAC aléatoires. Cela provoque une surcharge des tables d'adresses MAC. Lorsque les tables sont pleines, les commutateurs transmettent tous les paquets à tous les périphériques du réseau, ce qui entraîne une diffusion générale des paquets et perturbe les communications normales. L'objectif de cette attaque est de causer un déni de service en épuisant les ressources du réseau ou de faciliter d'autres attaques en profitant de la confusion causée par la diffusion des paquets. Un outil est utilisé pour mesurer l'impact de l'attaque en comparant le nombre de paquets diffusés avant et après son exécution, afin de déterminer si le réseau est vulnérable à cette attaque.",
    "constat": "Une mauvaise configuration ou des vulnérabilités dans les protocoles TLS peuvent exposer les communications à des attaques telles que le détournement ou l'interception des données.",
    "remediation": "Pour renforcer la sécurité des communications TLS, il est essentiel de suivre les bonnes pratiques de configuration, de mettre à jour régulièrement les versions TLS et d'effectuer des tests de vulnérabilité pour détecter les éventuelles faiblesses dans la configuration du protocole.",
    "criticite": "Majeure",
    "scoring": 2
  },
  "no_result": {
    "constat": "Nous n'avons détecté aucune vulnérabilité avec ce test."
  }
}

