{
  "entete_web": {
    "titre": "Vérification des en-têtes web",
    "description": "Ce test a pour but d’inspecter les en-têtes HTTP/HTTPS renvoyés par les serveurs web au sein du système d'information. Ces en-têtes peuvent souvent révéler des informations sur les technologies et les versions logicielles utilisées par le serveur, qui peuvent à leur tour indiquer des vulnérabilités potentielles. Plus précisément, notre outil examine la présence de certains champs d'en-tête dont l'exposition est typiquement vue comme un défaut de configuration. Cela inclut : - Server : Il fournit des informations sur le logiciel du serveur web, y compris la version, ce qui pourrait aider les attaquants à identifier des vulnérabilités connues.- X-Powered-By : Il indique le langage de programmation ou la technologie utilisée par le serveur web, ce qui peut également aider un attaquant à cibler des vulnérabilités spécifiques. - X-AspNet-Version : Similaire à X-Powered-By, ce champ expose la version d'ASP.NET utilisée, donnant une autre voie potentielle pour cibler des vulnérabilités spécifiques.- Access-Control-Allow-Origin : Cet en-tête peut indiquer si le serveur autorise des requêtes de sources externes, ce qui peut introduire des risques de sécurité si mal configurés. Ces informations, bien que souvent utiles pour le débogage et le développement, peuvent en réalité fournir à un attaquant potentiel des informations précieuses sur la configuration du serveur. Par conséquent, il est généralement recommandé de supprimer ou de masquer ces en-têtes en production.",
    "constat": "Il a été découvert que votre système expose des en-têtes HTTP inappropriés. Ces en-têtes peuvent divulguer des informations sensibles et permettre des attaques telles que l'injection de scripts.",
    "remediation": "Pour résoudre ce problème, il est recommandé de configurer correctement les en-têtes HTTP. Cela peut inclure la suppression de certains en-têtes ou la modification des informations qu'ils divulguent. Des directives de sécurité appropriées devraient être suivies pour assurer une configuration sécurisée.",
    "criticite": "Mineure",
    "scoring": 0.2
  },
  "cve": {
    "titre": "Détection de Vulnérabilités répertoriées",
    "description": "Une analyse approfondie des services et versions de votre système a été effectuée pour déterminer la présence de vulnérabilités CVE (Common Vulnerabilities and Exposures) connues.",
    "constat": "Plusieurs services actuellement utilisés dans votre système sont associés à des vulnérabilités CVE connues. Ces vulnérabilités, liées aux versions spécifiques des services, pourraient permettre à des attaquants d'exploiter les failles pour compromettre vos données.",
    "remediation": "Il est fortement recommandé de mettre à jour ces services vers les versions les plus récentes et sécurisées pour éliminer ces vulnérabilités. Des mises à jour régulières et une surveillance constante des bulletins de sécurité aideront à atténuer ces risques.",
    "criticite": "Modérée",
    "scoring": 0.4
  },
  "ssh_bf": {
    "titre": "Attaque par dictionnaire sur SSH",
    "description": "Le protocole SSH (Secure Shell) est largement utilisé pour l'administration à distance de systèmes Linux. Malheureusement. L'objectif de cette attaque est de réaliser une attaque par dictionnaire en utilisant une liste de mots de passe conçus par nos soins. Ce test consiste à essayer différents mots de passe de la liste générée pour tenter de compromettre les comptes SSH. Il permet de vérifier la résistance des mots de passe utilisés.",
    "constat": "Dans votre infrastructure nous avons detecté des services SSH avec des mots de passes faibles.",
    "remediation": "Pour corriger la vulnérabilité de mot de passe faible sur SSH, vous pouvez mettre en place une politique de complexité de mot de passe, utiliser des outils de gestion de mots de passe, mettre en place la double authentification, limiter l'accès aux comptes utilisateurs et surveiller l'activité du compte utilisateur. En appliquant ces mesures, vous pouvez renforcer la sécurité de votre système SSH et prévenir les attaques par force brute.",
    "criticite": "Majeure",
    "scoring": 1.2
  },
  "smb_scanner": {
    "titre": "Découverte de partages de fichiers publics",
    "description": "Les partages de fichiers anonymes sont des services qui permettent à tout utilisateur d'accéder à certains fichiers ou dossiers sans nécessiter d'authentification ou de vérification d'identité. Ces services sont souvent utilisés pour faciliter le partage de fichiers sur un réseau, mais ils peuvent aussi présenter un risque pour la sécurité des informations. La présence d'un accès anonyme aux partages de fichiers est en effet un défaut de configuration qui peut potentiellement compromettre la confidentialité des données. Par exemple, si des fichiers contenant du code source se trouvent dans ces dossiers partagés, cela pourrait augmenter le vecteur d'attaque et faciliter la propagation d'une attaque vers d'autres systèmes. Il est à noter que ce test exclut spécifiquement les dossiers NETLOGON et SYSVOL. Ces dossiers sont propres à l'infrastructure Active Directory et sont nécessairement accessibles au public par défaut.",
    "constat": "Votre système permet actuellement le partage de fichiers avec des connexions anonymes. Cela peut exposer vos fichiers à des utilisateurs non authentifiés, potentiellement donnant accès à des informations sensibles à des personnes non autorisées",
    "remediation": "Il est important de restreindre l'accès aux partages de fichiers en utilisant des autorisations appropriées, des mots de passe forts et en limitant les droits d'accès des utilisateurs.",
    "criticite": "Modérée",
    "scoring": 0.4
  },
  "dhcp_starvation": {
    "titre": "Epuisement de ressources DHCP",
    "description": "L'attaque DHCP Starvation est une attaque de type déni de service qui vise à épuiser toutes les adresses IP disponibles dans le pool de distribution d'un serveur DHCP (Dynamic Host Configuration Protocol). Le but est de saturer le réseau avec des demandes DHCP de manière que le serveur DHCP ne puisse plus distribuer d'adresse IP aux clients légitimes. Afin de réaliser cette attaque, de nombreuses demandes de DHCP DISCOVER (requête broadcast permettant d’initialiser la connexion avec le serveur DHCP) sont envoyées sur le réseau, chacune étant marquée par une adresse MAC unique et générée aléatoirement. L'objectif de ces requêtes est de solliciter la distribution d'une adresse IP par le serveur DHCP. Chaque demande est traitée par le serveur DHCP qui alloue une adresse IP à l'adresse MAC qui a initié la demande. Étant donné que chaque demande semble provenir d'un nouveau client (en raison des adresses MAC uniques), le serveur DHCP épuise rapidement son pool d'adresses IP.",
    "constat": "Actuellement, votre système est vulnérables aux attaques de saturation DHCP peuvent épuiser les adresses IP disponibles dans le pool DHCP, empêchant ainsi les nouveaux périphériques de se connecter au réseau.",
    "remediation": "Pour prévenir les attaques de saturation DHCP, il est recommandé de surveiller et de limiter le nombre de demandes DHCP par périphérique, d'appliquer des stratégies de contrôle d'accès et de configurer des mécanismes de détection d'anomalies.",
    "criticite": "Modérée",
    "scoring": 2.5
  },
  "wifi": {
    "titre": "Faiblesse du mot de passe WiFi",
    "description": "Le test de robustesse des mots de passe des points d'accès Wi-Fi évalue la sécurité des mots de passe utilisés pour les protéger. Il consiste à écouter le réseau pour repérer les points d'accès Wi-Fi disponibles. Ensuite, on force les utilisateurs connectés à se reconnecter afin de capturer l'échange de messages entre leur appareil et le point d'accès, appelé handshake. En analysant ce handshake, on extrait les informations nécessaires pour mener une attaque par dictionnaire sur le mot de passe du point d'accès. Un dictionnaire spécialement conçu est utilisé pour tester la solidité du mot de passe.",
    "constat": "Suite à notre test, il a été constaté que le mot de passe de votre réseau Wi-Fi n'est pas suffisamment robuste. Un attaquant pourrait potentiellement utiliser une attaque par dictionnaire pour déchiffrer le mot de passe, mettant ainsi votre réseau en danger.",
    "remediation": "Pour remédier aux vulnérabilités liées aux mots de passe faibles sur les réseaux Wi-Fi, vous pouvez : utiliser des mots de passe forts, changer régulièrement les mots de passe, utiliser des protocoles de sécurité plus forts, limiter l'accès aux réseaux et surveiller régulièrement la sécurité des réseaux.",
    "criticite": "Majeure",
    "scoring": 3
  },
  "check_tls": {
    "titre": "Robustesse des certificats web",
    "description": "Ce test a pour but d’inspecter les protocoles des certificats des serveurs web HTTPS au sein du SI. Le protocole de chiffrement utilisé par un serveur web pour sécuriser la communication entre le serveur et les clients est crucial pour assurer l'intégrité et la confidentialité des données échangées. Certains protocoles plus anciens, comme SSLv2, SSLv3, TLSv1 et TLSv1.1, sont considérés comme vulnérables et obsolètes. Ils présentent des failles de sécurité connues qui les rendent susceptibles d'être exploités par des attaquants. Par exemple, SSLv3 est vulnérable à l'attaque POODLE (Padding Oracle On Downgraded Legacy Encryption), qui peut permettre à un attaquant de déchiffrer les informations chiffrées.",
    "constat": "Votre système possède Une mauvaise configuration ou des vulnérabilités dans les protocoles TLS peuvent exposer les communications à des attaques telles que le détournement ou l'interception des données.",
    "remediation": "Pour renforcer la sécurité des communications TLS, il est essentiel de suivre les bonnes pratiques de configuration, de mettre à jour régulièrement les versions TLS et d'effectuer des tests de vulnérabilité pour détecter les éventuelles faiblesses dans la configuration du protocole.",
    "criticite": "Mineure",
    "scoring": 0.2
  },
  "banner": {
    "titre": "Découverte des bannières de services",
    "description": "Une bannière  dans le contexte des services réseau est une information que le service partage lorsqu'il établit une connexion. Elle peut inclure des détails sur le type de service, la version du logiciel, le système d'exploitation du serveur et d'autres informations. Les bannières sont souvent les premières informations qu'un client reçoit d'un serveur après avoir établi une connexion.  Il est recommandé de désactiver ces bannières, car un « scan de bannières » est une technique utilisée en cybersécurité permettant d’identifier et collecter des informations sur un service spécifique sur un hôte ou un serveur. Par exemple, un attaquant peut scanner un serveur pour déterminer quel type de serveur web il utilise (Apache, IIS, Nginx, etc.) et quelle version du logiciel est en cours d'exécution puis récupérer des vulnérabilités associées à la version du serveur web.",
    "constat": "Votre système expose actuellement des bannières de services qui pourraient donner des informations précieuses à un attaquant potentiel. Ces informations peuvent inclure des détails sur les versions de logiciel, qui pourraient être utilisées pour identifier les vulnérabilités connues.",
    "remediation": "Il est recommandé de configurer les services pour minimiser les informations exposées dans les bannières. Cela pourrait impliquer la désactivation de certaines bannières ou la modification des messages pour qu'ils divulguent moins d'informations sur le système.",
    "criticite": "Mineure",
    "scoring": 0.2
  },
  "netbios": {
    "titre": "Vérification du service NetBios",
    "description": "NetBIOS (Network Basic Input/Output System) est une ancienne interface de programmation d'applications (API) permettant la communication entre des ordinateurs via un réseau local. NetBIOS fournit des services liés à la couche de session du modèle OSI, permettant aux applications sur différents ordinateurs de communiquer sur un réseau local. NetBIOS a été largement utilisé dans les versions antérieures des systèmes d'exploitation Windows (jusqu'à Windows 2000 et XP) pour partager des fichiers et des imprimantes au sein d'un réseau local. Une évaluation du service NetBIOS de votre système a été effectuée pour déterminer les possibles vulnérabilités et expositions",
    "constat": "Votre système utilise actuellement le service NetBIOS. Bien que NetBIOS puisse être nécessaire pour certaines fonctions réseau, son utilisation peut également exposer le système à des risques de sécurité, tels que la divulgation d'informations sur le système ou la réalisation d'attaques de type 'man-in-the-middle'.",
    "remediation": "Il est recommandé de désactiver le service NetBIOS si celui-ci n'est pas nécessaire pour les opérations du système. Si le service est nécessaire, des mesures de sécurité supplémentaires, telles que des pare-feux et des protocoles de sécurité renforcés, devraient être mises en place pour protéger le système",
    "criticite": "Mineure",
    "scoring": 0.2
  },
  "spanning-tree": {
    "titre": "Vérification de la configuration du protocole STP",
    "description": "Le protocole STP (Spanning Tree) est une technologie de réseau permettant d'éviter les boucles destructrices dans les réseaux où plusieurs chemins existent entre les commutateurs. Il sélectionne un commutateur central appelé Root Bridge par un processus d'élection basé sur les Bridge ID (BID). Chaque commutateur définit ensuite le rôle de ses ports, qui peuvent être des Root Ports, des Designated Ports, ou des Blocking Ports, en fonction de leur coût de chemin vers le Root Bridge. Les BPDU (Bridge Protocol Data Unit) sont des paquets de données utilisés pour partager les informations sur la topologie du réseau et pour détecter les modifications de celle-ci. En cas de changement, le protocole STP est relancé pour maintenir un réseau sans boucle. Une attaque STP peut perturber ce fonctionnement en injectant de fausses informations, ce qui permet à l'attaquant de contrôler le trafic réseau. Pour prévenir de telles attaques, on peut utiliser le 'BPDU Guard' qui place le port en état d'écoute lorsqu'un BPDU suspect est reçu, empêchant ainsi l'attaquant de devenir la racine de l'arbre STP.",
    "constat": "Votre configuration actuelle du protocole STP pourrait être vulnérable à des attaques visant à obtenir un accès root. Un attaquant pourrait potentiellement manipuler le protocole STP pour devenir le pont racine, permettant ainsi de contrôler le trafic réseau.",
    "remediation": "Il est recommandé de sécuriser la configuration du protocole STP pour prévenir ces attaques. Cela peut inclure la mise en œuvre de BPDU Guard pour bloquer les BPDUs indésirables, l'utilisation de Root Guard pour protéger le rôle du pont racine, et l'activation de STP Path Cost pour empêcher l'usurpation de la route STP par un attaquant.",
    "criticite": "Majeure",
    "scoring": 0.6
  },
  "mac-flooding": {
    "titre": "Saturation d'adresse MAC sur commutateur",
    "description": "L'attaque par inondation MAC (MAC flooding) ou encore appelée Cam Overflow pour « CAM Table Overflow Attack » est une technique d'attaque sur les réseaux commutés. Le terme « CAM » vient de « Content Addressable Memory », qui est le type de mémoire que beaucoup de commutateurs utilisent pour stocker leur table d'adresses MAC. L'objectif de cette attaque est de saturer la table d'adresses MAC du commutateur réseau (ou plus couramment appelé switch), qui est une structure de données que le commutateur utilise pour mémoriser à quel port chaque adresse MAC est associée. Dans une attaque par inondation MAC, l'attaquant envoie une grande quantité de trames Ethernet sur le réseau, chacune avec une différente adresse MAC source. Puisque le commutateur ajoute chaque nouvelle adresse MAC à sa table, une attaque par inondation MAC peut rapidement la remplir. La plupart des commutateurs ont une taille de table d'adresses MAC limitée, donc lorsque la table est pleine, le commutateur peut commencer à agir comme un hub et envoyer toutes les trames reçues à tous les ports, plutôt que seulement au port associé à l'adresse MAC de destination. Cela peut permettre à l'attaquant de voir le trafic qui n'était pas initialement destiné à lui, menant à une atteinte à la confidentialité.",
    "constat": "Votre réseau actuel semble vulnérable à une attaque par inondation MAC. Sans une protection adéquate, un attaquant pourrait potentiellement surcharger la table d'adresses MAC de votre switch, forçant celui-ci à envoyer tout le trafic à toutes les ports, ce qui pourrait permettre à un attaquant de sniffer le trafic réseau",
    "remediation": "Il est recommandé d'implémenter des mesures de protection pour prévenir les attaques par inondation MAC. Cela pourrait inclure la configuration de votre switch pour limiter le nombre d'adresses MAC qui peuvent être apprises sur chaque port, et l'activation de fonctionnalités de sécurité comme le port security sur les switches pour contrôler l'accès au réseau.",
    "criticite": "Majeure",
    "scoring": 3
  },
  "web_vuln": {
    "titre": "Vérification du protocole web",
    "description": "Le protocole HTTP (HyperText Transfer Protocol) est le protocole de communication utilisé pour la transmission des informations sur le web. Lorsqu'un utilisateur entre une URL dans un navigateur web, un client HTTP envoie une requête HTTP au serveur où le site web est hébergé. Le serveur répond alors avec le contenu de la page web, qui est également envoyé en utilisant le protocole HTTP. Il est recommandé de ne pas utiliser le protocole HTTP, car il transmet les données en clair, ce qui signifie que si un attaquant peut intercepter la communication (Man In The Middle - « MITM »), il peut lire et modifier le contenu de la communication. Cela peut être particulièrement problématique lorsqu'il s'agit de données sensibles, comme des mots de passe ou des informations de carte de crédit. De plus, HTTP ne vérifie pas si la communication provient de la source qu'elle prétend être. Cela peut permettre à un attaquant de se faire passer pour un site web légitime pour tromper les utilisateurs et recueillir des informations sensibles.",
    "constat": "Votre système utilise actuellement le protocole HTTP pour certaines communications, qui ne sont pas chiffrées. Cela peut exposer des informations sensibles à des personnes malveillantes qui pourraient être en mesure d'intercepter ces communications.",
    "remediation": "Il est fortement recommandé de passer à l'utilisation du protocole HTTPS, qui chiffre les communications pour protéger les informations sensibles. Assurez-vous également de rediriger tout le trafic HTTP vers HTTPS pour prévenir les fuites d'informations.",
    "criticite": "Modérée",
    "scoring": 0.5
  },
  "telnet": {
    "titre": "Vérification du protocole Telnet",
    "description": "Telnet est un protocole réseau qui permet d'ouvrir une session interactive sur une machine distante. Il a été développé à l'origine dans les années 1960 pour permettre l'accès aux mainframes et aux systèmes informatiques basés sur des terminaux. Telnet fournit une communication bidirectionnelle en texte brut, interactif et orienté caractère. Il est recommandé de ne pas utiliser Telnet. Comme Telnet n'offre aucune forme de chiffrement pour les données qui sont transmises entre l'hôte et le client, il présente un risque de sécurité majeur. Toutes les données transmises, y compris les identifiants et les mots de passe, peuvent être facilement interceptées en clair par un attaquant qui écoute sur le réseau. Cela peut donner lieu à des attaques de Man In The Middle, où l'attaquant intercepte et/ou modifie les données transmises.",
    "constat": "Votre système utilise actuellement le protocole Telnet pour certaines communications. Telnet transmet des informations en texte clair, ce qui peut exposer des données sensibles, y compris les identifiants, à des attaquants capables d'intercepter ces communications.",
    "remediation": "Il est fortement recommandé de désactiver l'utilisation de Telnet et de passer à des méthodes de communication plus sécurisées, telles que SSH, qui chiffrent les informations transmises. Si Telnet doit être utilisé pour des raisons spécifiques, des mesures de sécurité supplémentaires, telles que l'utilisation de VPNs, devraient être mises en place pour protéger les données transmises.",
    "criticite": "Majeure",
    "scoring": 0.8
  },
  "no_result": {
    "constat": "Suite à notre évaluation, nous sommes heureux de rapporter que nous n'avons détecté aucune vulnérabilité dans le cadre de ce test spécifique. Cela indique que les mesures de sécurité en place pour cette partie de votre système sont efficaces."
  }
}
